In [1]:
import pandas as pd
import numpy as np

In [2]:
# 2차원 데이트
# 리스트-리스트,리스트-튜플,리스트-딕셔러니,딕셔너리(키 값: 리스트)
d1=[[1,2],[3,4],[5,6]]
d2=[(1,2),(3,4),(5,6)]
d3=[{'kor':1, 'eng':2},
    {'kor':3, 'eng':4},
    {'kor':5, 'eng':6}]
d4={'kor':[1,3,5],'eng':[2,4,6]}

In [4]:
df1= pd.DataFrame(d1)
df1

   0  1
0  1  2
1  3  4
2  5  6

In [5]:
df2= pd.DataFrame(d2)
df2

   0  1
0  1  2
1  3  4
2  5  6

In [6]:
# 키 값 = 컬럼 명
df3= pd.DataFrame(d3)
df3

   kor  eng
0    1    2
1    3    4
2    5    6

In [7]:
df4= pd.DataFrame(d4)
df4

   kor  eng
0    1    2
1    3    4
2    5    6

In [10]:
df1= pd.DataFrame(d1, index=['a','b','c'], columns=['kor','eng'])
df1

   kor  eng
a    1    2
b    3    4
c    5    6

In [12]:
data ={'eng':[10,30,50,70],
      'kor':[20,40,60,80],
      'math':[90,50,20,70]}
df = pd.DataFrame(data, index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70